espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp_ble_dual_role/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_mipi_dsi.c
#if (defined(FSL_FEATURE_DSI_CSR_OFFSET) && FSL_FEATURE_DSI_CSR_OFFSET)
    MIPI_DSI_CSR_Type *csr = DSI_GET_CSR(base);
    csr->PXL2DPI_CONFIG    = config->dpiColorCoding;
#endif

    base->DSI_HOST_CFG_DPI_PIXEL_PAYLOAD_SIZE     = config->pixelPayloadSize;
    base->DSI_HOST_CFG_DPI_INTERFACE_COLOR_CODING = config->dpiColorCoding;
    base->DSI_HOST_CFG_DPI_PIXEL_FORMAT           = config->pixelPacket;
    base->DSI_HOST_CFG_DPI_VIDEO_MODE             = config->videoMode;

    if (kDSI_DpiBllpLowPower == config->bllpMode)
    {
        base->DSI_HOST_CFG_DPI_BLLP_MODE         = 0x1U;
        base->DSI_HOST_CFG_DPI_USE_NULL_PKT_BLLP = 0x0U;
    }
    else if (kDSI_DpiBllpBlanking == config->bllpMode)
    {
        base->DSI_HOST_CFG_DPI_BLLP_MODE         = 0x0U;
        base->DSI_HOST_CFG_DPI_USE_NULL_PKT_BLLP = 0x0U;
    }
    else
    {
        base->DSI_HOST_CFG_DPI_BLLP_MODE         = 0x0U;
        base->DSI_HOST_CFG_DPI_USE_NULL_PKT_BLLP = 0x1U;
    }

    if (config->polarityFlags & kDSI_DpiVsyncActiveHigh)
    {
        base->DSI_HOST_CFG_DPI_VSYNC_POLARITY = 0x01U;
    }
    else
    {
        base->DSI_HOST_CFG_DPI_VSYNC_POLARITY = 0x00U;
    }

    if (config->polarityFlags & kDSI_DpiHsyncActiveHigh)
    {
        base->DSI_HOST_CFG_DPI_HSYNC_POLARITY = 0x01U;
    }
    else
    {
        base->DSI_HOST_CFG_DPI_HSYNC_POLARITY = 0x00U;
    }

    if (kDSI_DpiNonBurstWithSyncPulse == config->videoMode)
    {
        base->DSI_HOST_CFG_DPI_HFP                   = config->hfp - DSI_HFP_OVERHEAD_BYTE;
        base->DSI_HOST_CFG_DPI_HBP                   = config->hbp - DSI_HBP_OVERHEAD_BYTE;
        base->DSI_HOST_CFG_DPI_HSA                   = config->hsw - DSI_HSA_OVERHEAD_BYTE;
        base->DSI_HOST_CFG_DPI_PIXEL_FIFO_SEND_LEVEL = 8;
    }
    else
    {
        base->DSI_HOST_CFG_DPI_HFP                   = config->hfp * coff;
        base->DSI_HOST_CFG_DPI_HBP                   = config->hbp * coff;
        base->DSI_HOST_CFG_DPI_HSA                   = config->hsw * coff;
        base->DSI_HOST_CFG_DPI_PIXEL_FIFO_SEND_LEVEL = config->pixelPayloadSize;
    }

    base->DSI_HOST_CFG_DPI_VBP = config->vbp;
    base->DSI_HOST_CFG_DPI_VFP = config->vfp;

    base->DSI_HOST_CFG_DPI_VACTIVE = config->panelHeight - 1U;
    base->DSI_HOST_CFG_DPI_VC      = config->virtualChannel;
}

/*!
 * brief Initializes the D-PHY
 *
 * This function configures the D-PHY timing and setups the D-PHY PLL based on
 * user configuration. The configuration structure could be got by the function
 * ref DSI_GetDphyDefaultConfig.
 *
 * param base MIPI DSI host peripheral base address.
 * param config Pointer to the D-PHY configuration.
 * param refClkFreq_Hz The REFCLK frequency in Hz.
 * return The actual D-PHY PLL output frequency. If could not configure the
 * PLL to the target frequency, the return value is 0.
 */
uint32_t DSI_InitDphy(MIPI_DSI_HOST_Type *base, const dsi_dphy_config_t *config, uint32_t refClkFreq_Hz)
{
    assert(config);

#if !((defined(FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    uint32_t cn, cm, co, outputPllFreq;

    outputPllFreq = DSI_DphyGetPllDivider(&cn, &cm, &co, refClkFreq_Hz, config->txHsBitClk_Hz);

    /* If could not find dividers for the output PLL frequency. */
    if (!outputPllFreq)
    {
        return 0U;
    }

    /* Set the DPHY parameters. */
    base->DPHY_CN = DSI_EncodeDphyPllCn(cn);
    base->DPHY_CM = DSI_EncodeDphyPllCm(cm);
    base->DPHY_CO = co;
#endif

    /* Set the timing parameters. */
    base->DPHY_M_PRG_HS_PREPARE  = config->tHsPrepare_HalfEscClk - DSI_THS_PREPARE_HALF_ESC_CLK_BASE;
    base->DPHY_MC_PRG_HS_PREPARE = config->tClkPrepare_HalfEscClk - DSI_TCLK_PREPARE_HALF_ESC_CLK_BASE;
    base->DPHY_M_PRG_HS_ZERO     = config->tHsZero_ByteClk - DSI_THS_ZERO_BYTE_CLK_BASE;
    base->DPHY_MC_PRG_HS_ZERO    = config->tClkZero_ByteClk - DSI_TCLK_ZERO_BYTE_CLK_BASE;
    base->DPHY_M_PRG_HS_TRAIL    = config->tHsTrail_ByteClk;
    base->DPHY_MC_PRG_HS_TRAIL   = config->tClkTrail_ByteClk;

    base->DSI_HOST_CFG_T_PRE   = config->tClkPre_ByteClk;
    base->DSI_HOST_CFG_T_POST  = config->tClkPost_ByteClk;
    base->DSI_HOST_CFG_TX_GAP  = config->tHsExit_ByteClk;
    base->DSI_HOST_CFG_TWAKEUP = config->tWakeup_EscClk;

#if defined(MIPI_DSI_HOST_DPHY_RTERM_SEL_dphy_rterm_sel_MASK)
    base->DPHY_RTERM_SEL = MIPI_DSI_HOST_DPHY_RTERM_SEL_dphy_rterm_sel_MASK;
#endif
#if defined(MIPI_DSI_HOST_DPHY_TX_RCAL_dphy_tx_rcal_MASK)
    base->DPHY_TX_RCAL = 1;
#endif
    base->DPHY_RXLPRP = 1;
    base->DPHY_RXCDRP = 1;

    /* Auto power down the inactive lanes. */
    base->DPHY_AUTO_PD_EN = 0x1U;

    base->DPHY_TST = 0x25U;

#if !((defined(FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    /* Power up the PLL. */
    base->DPHY_PD_PLL = 0U;

    /* Wait for the PLL lock. */
    while (!base->DPHY_LOCK)
    {
    }
#endif

    /* Power up the DPHY. */
    base->DPHY_PD_REG = 0U;

#if !((defined(FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    return outputPllFreq;
#else
    return config->txHsBitClk_Hz;
#endif
}

/*!
 * brief Deinitializes the D-PHY
 *
 * Power down the D-PHY PLL and shut down D-PHY.
 *
 * param base MIPI DSI host peripheral base address.
 */
void DSI_DeinitDphy(MIPI_DSI_HOST_Type *base)
{
#if !((defined(FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    /* Power down the PLL. */
    base->DPHY_PD_PLL = 1U;
#endif

    /* Power down the DPHY. */
    base->DPHY_PD_REG = 1U;
}

/*!
 * brief Get the default D-PHY configuration.
 *
 * Gets the default D-PHY configuration, the timing parameters are set according
 * to D-PHY specification. User could use the configuration directly, or change
 * some parameters according to the special device.
 *
 * param config Pointer to the D-PHY configuration.
 * param txHsBitClk_Hz High speed bit clock in Hz.
 * param txEscClk_Hz Esc clock in Hz.
 */
void DSI_GetDphyDefaultConfig(dsi_dphy_config_t *config, uint32_t txHsBitClk_Hz, uint32_t txEscClk_Hz)
{
    assert(config);

    /* Initializes the configure structure to zero. */
    memset(config, 0, sizeof(*config));

    uint32_t byteClkFreq_kHz = txHsBitClk_Hz / 8U / 1000U;

