espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp_ble_dual_role/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_mipi_dsi.c
    config->txHsBitClk_Hz = txHsBitClk_Hz;

    /* TCLK-PRE in byte clock. At least 8*UI. */
    config->tClkPre_ByteClk = 1U;

    /* TCLK-POST in byte clock. At least 60ns + 52*UI. */
    config->tClkPost_ByteClk = DSI_NS_TO_BYTE_CLK(60U, byteClkFreq_kHz) + (52U / 8U) + 2U;

    /* THS-EXIT in byte clock. At least 100ns. */
    config->tHsExit_ByteClk = DSI_NS_TO_BYTE_CLK(100U, byteClkFreq_kHz) + 1U;

    /* T-WAKEUP. At least 1ms. */
    config->tWakeup_EscClk = txEscClk_Hz / 1000U + 1U;

    /* THS-PREPARE. 40ns+4*UI to 85ns+6*UI. */
    config->tHsPrepare_HalfEscClk =
        (40U * txEscClk_Hz * 2U) / 1000000000U + (4U * txEscClk_Hz * 2U / txHsBitClk_Hz) + 1U;
    if (config->tHsPrepare_HalfEscClk < DSI_THS_PREPARE_HALF_ESC_CLK_BASE)
    {
        config->tHsPrepare_HalfEscClk = DSI_THS_PREPARE_HALF_ESC_CLK_BASE;
    }

    /* TCLK-PREPARE. 38ns to 95ns. */
    config->tClkPrepare_HalfEscClk = (38U * txEscClk_Hz * 2U) / 1000000000U + 1U;
    if (config->tClkPrepare_HalfEscClk < DSI_TCLK_PREPARE_HALF_ESC_CLK_BASE)
    {
        config->tClkPrepare_HalfEscClk = DSI_TCLK_PREPARE_HALF_ESC_CLK_BASE;
    }

    /* THS-ZERO, At least 105ns+6*UI. */
    config->tHsZero_ByteClk = DSI_NS_TO_BYTE_CLK(105U, byteClkFreq_kHz) + 1U;
    if (config->tHsZero_ByteClk < DSI_THS_ZERO_BYTE_CLK_BASE + 1U)
    {
        config->tHsZero_ByteClk = DSI_THS_ZERO_BYTE_CLK_BASE + 1U;
    }

    /* TCLK-ZERO, At least 262ns. */
    config->tClkZero_ByteClk = DSI_NS_TO_BYTE_CLK(262U, byteClkFreq_kHz) + 1U;
    if (config->tClkZero_ByteClk < DSI_TCLK_ZERO_BYTE_CLK_BASE + 1U)
    {
        config->tClkZero_ByteClk = DSI_TCLK_ZERO_BYTE_CLK_BASE + 1U;
    }

    /* THS-TRAIL, 60ns+4*UI to 105ns+12UI. */
    config->tHsTrail_ByteClk = DSI_NS_TO_BYTE_CLK(60U, byteClkFreq_kHz) + 2U;

    /* TCLK-TRAIL, at least 60ns. */
    config->tClkTrail_ByteClk = DSI_NS_TO_BYTE_CLK(60U, byteClkFreq_kHz) + 1U;
}

/*!
 * brief Configure the APB packet to send.
 *
 * This function configures the next APB packet transfer. After configuration,
 * the packet transfer could be started with function ref DSI_SendApbPacket.
 * If the packet is long packet, Use ref DSI_WriteApbTxPayload to fill the payload
 * before start transfer.
 *
 * param base MIPI DSI host peripheral base address.
 * param wordCount For long packet, this is the byte count of the payload.
 * For short packet, this is (data1 << 8) | data0.
 * param virtualChannel Virtual channel.
 * param dataType The packet data type, (DI).
 * param flags The transfer control flags, see ref _dsi_transfer_flags.
 */
void DSI_SetApbPacketControl(
    MIPI_DSI_HOST_Type *base, uint16_t wordCount, uint8_t virtualChannel, dsi_tx_data_type_t dataType, uint8_t flags)
{
    uint32_t pktCtrl = DSI_HOST_PKT_CONTROL_WORD_COUNT(wordCount) | DSI_HOST_PKT_CONTROL_VC(virtualChannel) |
                       DSI_HOST_PKT_CONTROL_HEADER_TYPE(dataType);

    if (flags & kDSI_TransferUseHighSpeed)
    {
        pktCtrl |= DSI_HOST_PKT_CONTROL_HS_MASK;
    }

    if (flags & kDSI_TransferPerformBTA)
    {
        pktCtrl |= DSI_HOST_PKT_CONTROL_BTA_MASK;
    }

    base->DSI_HOST_PKT_CONTROL = pktCtrl;
}

/*!
 * brief Fill the long APB packet payload.
 *
 * Write the long packet payload to TX FIFO.
 *
 * param base MIPI DSI host peripheral base address.
 * param payload Pointer to the payload.
 * param payloadSize Payload size in byte.
 */
void DSI_WriteApbTxPayload(MIPI_DSI_HOST_Type *base, const uint8_t *payload, uint16_t payloadSize)
{
    DSI_WriteApbTxPayloadExt(base, payload, payloadSize, false, 0U);
}

void DSI_WriteApbTxPayloadExt(
    MIPI_DSI_HOST_Type *base, const uint8_t *payload, uint16_t payloadSize, bool sendDscCmd, uint8_t dscCmd)
{
    uint32_t firstWord;
    uint32_t i;

    payloadSize = sendDscCmd ? payloadSize + 1U : payloadSize;

    assert(payloadSize <= FSL_DSI_TX_MAX_PAYLOAD_BYTE);

    /* The first 4-byte. */
    if (sendDscCmd)
    {
        firstWord = dscCmd;
    }
    else
    {
        firstWord = *payload;
        payload++;
    }

    payloadSize--;

    for (i = 1; i < 4; i++)
    {
        if (payloadSize > 0)
        {
            firstWord |= ((*payload) << (i << 3U));
            payload++;
            payloadSize--;
        }
        else
        {
            break;
        }
    }

    base->DSI_HOST_TX_PAYLOAD = firstWord;

    /* Write the payload to the FIFO. */
    for (i = 0; i < payloadSize / 4U; i++)
    {
        base->DSI_HOST_TX_PAYLOAD = *(uint32_t *)payload;
        payload += 4U;
    }

    /* Write the remaining data. */
    switch (payloadSize & 0x03U)
    {
        case 3:
            base->DSI_HOST_TX_PAYLOAD = ((uint32_t)payload[2] << 16U) | ((uint32_t)payload[1] << 8U) | payload[0];
            break;
        case 2:
            base->DSI_HOST_TX_PAYLOAD = ((uint32_t)payload[1] << 8U) | payload[0];
            break;
        case 1:
            base->DSI_HOST_TX_PAYLOAD = payload[0];
            break;
        default:
            break;
    }
}

static status_t DSI_PrepareApbTransfer(MIPI_DSI_HOST_Type *base, dsi_transfer_t *xfer)
{
    /* The receive data size should be smaller than the RX FIRO. */
    assert(xfer->rxDataSize <= FSL_DSI_RX_MAX_PAYLOAD_BYTE);
    assert(xfer->txDataSize <= FSL_DSI_TX_MAX_PAYLOAD_BYTE);

    uint8_t txDataIndex;
    uint16_t wordCount;
    uint32_t intFlags1, intFlags2;
    uint32_t txDataSize;

    if (xfer->rxDataSize > 2)
    {
        return kStatus_DSI_NotSupported;
    }

    if (xfer->rxDataSize)
    {
        xfer->flags |= kDSI_TransferPerformBTA;
    }

    /* ========================== Prepare TX. ========================== */
    /* If xfer->sendDscCmd is true, then the DSC command is not included in the
       xfer->txData, but specified by xfer->dscCmd.
     */
    txDataSize = xfer->sendDscCmd ? xfer->txDataSize + 1U : xfer->txDataSize;

