espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp_ble_dual_role/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_mipi_dsi.c
    /* Short packet. */
    if (txDataSize <= 2U)
    {
        if (0U == txDataSize)
        {
            wordCount = 0U;
        }
        else
        {
            txDataIndex = 0;

            if (xfer->sendDscCmd)
            {
                wordCount = xfer->dscCmd;
            }
            else
            {
                wordCount = xfer->txData[txDataIndex++];
            }

            if (2U == txDataSize)
            {
                wordCount |= ((uint32_t)xfer->txData[txDataIndex] << 8U);
            }
        }
    }
    /* Long packet. */
    else
    {
        wordCount = (uint16_t)txDataSize;
        DSI_WriteApbTxPayloadExt(base, xfer->txData, xfer->txDataSize, xfer->sendDscCmd, xfer->dscCmd);
    }

    DSI_SetApbPacketControl(base, wordCount, xfer->virtualChannel, xfer->txDataType, xfer->flags);

    /* Clear the interrupt flags set by previous transfer. */
    DSI_GetAndClearInterruptStatus(base, &intFlags1, &intFlags2);

    return kStatus_Success;
}

/*!
 * brief Read the long APB packet payload.
 *
 * Read the long packet payload from RX FIFO. This function reads directly but
 * does not check the RX FIFO status. Upper layer should make sure there are
 * available data.
 *
 * param base MIPI DSI host peripheral base address.
 * param payload Pointer to the payload.
 * param payloadSize Payload size in byte.
 */
void DSI_ReadApbRxPayload(MIPI_DSI_HOST_Type *base, uint8_t *payload, uint16_t payloadSize)
{
    uint32_t tmp;

    for (uint32_t i = 0; i < payloadSize / 4U; i++)
    {
        tmp        = base->DSI_HOST_PKT_RX_PAYLOAD;
        payload[0] = tmp & 0xFFU;
        payload[1] = (tmp >> 8U) & 0xFFU;
        payload[2] = (tmp >> 16U) & 0xFFU;
        payload[3] = (tmp >> 24U) & 0xFFU;
        payload += 4U;
    }

    /* Read out the remaining data. */
    if (payloadSize & 0x03U)
    {
        tmp = base->DSI_HOST_PKT_RX_PAYLOAD;

        for (uint32_t i = 0; i < (payloadSize & 0x3U); i++)
        {
            payload[i] = tmp & 0xFFU;
            tmp >>= 8U;
        }
    }
}

/*!
 * brief APB data transfer using blocking method.
 *
 * Perform APB data transfer using blocking method. This function waits until all
 * data send or received, or timeout happens.
 *
 * param base MIPI DSI host peripheral base address.
 * param xfer Pointer to the transfer structure.
 * retval kStatus_Success Data transfer finished with no error.
 * retval kStatus_Timeout Transfer failed because of timeout.
 * retval kStatus_DSI_RxDataError RX data error, user could use ref DSI_GetRxErrorStatus
 * to check the error details.
 * retval kStatus_DSI_ErrorReportReceived Error Report packet received, user could use
 *        ref DSI_GetAndClearHostStatus to check the error report status.
 * retval kStatus_DSI_NotSupported Transfer format not supported.
 * retval kStatus_DSI_Fail Transfer failed for other reasons.
 */
status_t DSI_TransferBlocking(MIPI_DSI_HOST_Type *base, dsi_transfer_t *xfer)
{
    status_t status;
    uint32_t intFlags1Old, intFlags2Old;
    uint32_t intFlags1New, intFlags2New;

    /* Wait for the APB state idle. */
    while (base->DSI_HOST_PKT_STATUS & kDSI_ApbNotIdle)
    {
    }

    status = DSI_PrepareApbTransfer(base, xfer);

    if (kStatus_Success != status)
    {
        return status;
    }

    DSI_SendApbPacket(base);

    /* Make sure the transfer is started. */
    while (1)
    {
        DSI_GetAndClearInterruptStatus(base, &intFlags1Old, &intFlags2Old);

        if (intFlags1Old & kDSI_InterruptGroup1ApbNotIdle)
        {
            break;
        }
    }

    /* Wait for transfer finished. */
    while (1)
    {
        /* Transfer completed. */
        if (!(base->DSI_HOST_PKT_STATUS & kDSI_ApbNotIdle))
        {
            break;
        }

        /* Time out. */
        if (base->DSI_HOST_RX_ERROR_STATUS & (kDSI_RxErrorHtxTo | kDSI_RxErrorLrxTo | kDSI_RxErrorBtaTo))
        {
            DSI_GetAndClearInterruptStatus(base, &intFlags1New, &intFlags2New);
            return kStatus_Timeout;
        }
    }

    DSI_GetAndClearInterruptStatus(base, &intFlags1New, &intFlags2New);

    return DSI_HandleResult(base, intFlags1Old | intFlags1New, intFlags2Old | intFlags2New, xfer);
}

static status_t DSI_HandleResult(MIPI_DSI_HOST_Type *base, uint32_t intFlags1, uint32_t intFlags2, dsi_transfer_t *xfer)
{
    uint32_t rxPktHeader;

    /* If hardware detect timeout. */
    if ((kDSI_InterruptGroup1HtxTo | kDSI_InterruptGroup1LrxTo | kDSI_InterruptGroup1BtaTo) & intFlags1)
    {
        return kStatus_Timeout;
    }

    /* If received data error. */
    if ((kDSI_InterruptGroup2EccMultiBit | kDSI_InterruptGroup2CrcError) & intFlags2)
    {
        return kStatus_DSI_RxDataError;
    }

    /* If BTA is performed. */
    if (xfer->flags & kDSI_TransferPerformBTA)
    {
        if (intFlags1 & DSI_INT_STATUS_ERROR_REPORT_MASK)
        {
            return kStatus_DSI_ErrorReportReceived;
        }

        if (kDSI_InterruptGroup1ApbRxHeaderReceived & intFlags1)
        {
            rxPktHeader = DSI_GetRxPacketHeader(base);

            /* If received error report. */
            if (kDSI_RxDataAckAndErrorReport == DSI_GetRxPacketType(rxPktHeader))
            {
                return kStatus_DSI_ErrorReportReceived;
            }
            else
            {
                /* Only handle short packet, long packet is not supported currently. */
                xfer->rxData[0] = rxPktHeader & 0xFFU;

                if (2U == xfer->rxDataSize)
                {
                    xfer->rxData[1] = (rxPktHeader >> 8U) & 0xFFU;
                }

                return kStatus_Success;
            }
        }

        return kStatus_Success;
    }
    else
    {
        /* Tx Done. */
        if (kDSI_InterruptGroup1ApbTxDone & intFlags1)
        {
            return kStatus_Success;
        }
    }

    return kStatus_Fail;
}

/*!
 * brief Create the MIPI DSI handle.
 *
 * This function initializes the MIPI DSI handle which can be used for other transactional APIs.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle Handle pointer.
 * param callback Callback function.
 * param userData User data.
 */
status_t DSI_TransferCreateHandle(MIPI_DSI_HOST_Type *base,
                                  dsi_handle_t *handle,
                                  dsi_callback_t callback,
                                  void *userData)
{
    assert(handle);

    uint8_t instance = DSI_GetInstance(base);

    /* Zero the handle */
    memset(handle, 0, sizeof(*handle));

    /* Initialize the handle */
    s_dsiHandle[instance] = handle;
    handle->callback      = callback;
    handle->userData      = userData;
    handle->isBusy        = false;
    s_dsiIsr              = DSI_TransferHandleIRQ;

#if defined(MIPI_DSI_HOST_IRQS)
    /* Enable interrupt in NVIC. */
    EnableIRQ(s_dsiIRQ[instance]);
#endif

    return kStatus_Success;
}

/*!
 * brief APB data transfer using interrupt method.
 *
 * Perform APB data transfer using interrupt method, when transfer finished,
 * upper layer could be informed through callback function.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 * param xfer Pointer to the transfer structure.
 *
 * retval kStatus_Success Data transfer started successfully.
 * retval kStatus_DSI_Busy Failed to start transfer because DSI is busy with pervious transfer.
 * retval kStatus_DSI_NotSupported Transfer format not supported.
 */
status_t DSI_TransferNonBlocking(MIPI_DSI_HOST_Type *base, dsi_handle_t *handle, dsi_transfer_t *xfer)
{
    status_t status;

    if ((handle->isBusy) || (base->DSI_HOST_PKT_STATUS & kDSI_ApbNotIdle))
    {
        return kStatus_DSI_Busy;
    }

