espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp_ble_dual_role/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_mipi_dsi.c
    handle->xfer = *xfer;

    status = DSI_PrepareApbTransfer(base, &handle->xfer);

    if (kStatus_Success != status)
    {
        return status;
    }

    DSI_SendApbPacket(base);
    handle->isBusy = true;

    /* Enable the interrupts. */
    if (handle->xfer.flags & kDSI_TransferPerformBTA)
    {
        DSI_EnableInterrupts(base,
                             DSI_INT_STATUS_TRIGGER_MASK | kDSI_InterruptGroup1ApbRxHeaderReceived |
                                 kDSI_InterruptGroup1ApbRxPacketReceived | kDSI_InterruptGroup1BtaTo |
                                 kDSI_InterruptGroup1LrxTo | kDSI_InterruptGroup1HtxTo |
                                 kDSI_InterruptGroup1AckTriggerReceived,
                             kDSI_InterruptGroup2EccMultiBit | kDSI_InterruptGroup2CrcError);
    }
    else
    {
        DSI_EnableInterrupts(base, kDSI_InterruptGroup1ApbTxDone | kDSI_InterruptGroup1HtxTo, 0U);
    }

    return kStatus_Success;
}

/*!
 * brief Abort current APB data transfer.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
void DSI_TransferAbort(MIPI_DSI_HOST_Type *base, dsi_handle_t *handle)
{
    assert(handle);

    if (handle->isBusy)
    {
        /* Disable the interrupts. */
        DSI_DisableInterrupts(base,
                              kDSI_InterruptGroup1ApbTxDone | DSI_INT_STATUS_TRIGGER_MASK |
                                  DSI_INT_STATUS_ERROR_REPORT_MASK | kDSI_InterruptGroup1ApbRxHeaderReceived |
                                  kDSI_InterruptGroup1ApbRxPacketReceived | kDSI_InterruptGroup1BtaTo |
                                  kDSI_InterruptGroup1LrxTo | kDSI_InterruptGroup1HtxTo,
                              kDSI_InterruptGroup2EccMultiBit | kDSI_InterruptGroup2CrcError);

        /* Reset transfer info. */
        memset(&handle->xfer, 0, sizeof(handle->xfer));

        /* Reset the state to idle. */
        handle->isBusy = false;
    }
}

/*!
 * @brief Interrupt handler for the DSI.
 *
 * @param base MIPI DSI host peripheral base address.
 * @param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
/*!
 * brief Interrupt handler for the DSI.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
void DSI_TransferHandleIRQ(MIPI_DSI_HOST_Type *base, dsi_handle_t *handle)
{
    assert(handle);

    status_t status;
    uint32_t intFlags1, intFlags2;
    uint32_t timeout;

    /* If no transfer in progress, return directly. */
    if (!handle->isBusy)
    {
        return;
    }

    /* Make sure the transfer is completed. */
    timeout = FSL_MIPI_DSI_IDLE_TIMEOUT;
    while (timeout--)
    {
        if (!(base->DSI_HOST_PKT_STATUS & kDSI_ApbNotIdle))
        {
            break;
        }
    }

    if (!timeout)
    {
        DSI_TransferAbort(base, handle);
        status = kStatus_Timeout;
    }
    else
    {
        /* Disable the interrupts. */
        DSI_DisableInterrupts(base,
                              kDSI_InterruptGroup1ApbTxDone | DSI_INT_STATUS_TRIGGER_MASK |
                                  DSI_INT_STATUS_ERROR_REPORT_MASK | kDSI_InterruptGroup1ApbRxHeaderReceived |
                                  kDSI_InterruptGroup1ApbRxPacketReceived | kDSI_InterruptGroup1BtaTo |
                                  kDSI_InterruptGroup1LrxTo | kDSI_InterruptGroup1HtxTo,
                              kDSI_InterruptGroup2EccMultiBit | kDSI_InterruptGroup2CrcError);

        DSI_GetAndClearInterruptStatus(base, &intFlags1, &intFlags2);

        status         = DSI_HandleResult(base, intFlags1, intFlags2, &handle->xfer);
        handle->isBusy = false;
    }

    if (handle->callback)
    {
        handle->callback(base, handle, status, handle->userData);
    }
}

#if defined(MIPI_DSI_HOST)
void MIPI_IRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST, s_dsiHandle[0]);
}
#endif

#if defined(MIPI_DSI_HOST0)
void MIPI_DSI0_INT_OUT_IRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST0, s_dsiHandle[0]);
}
#endif

#if defined(MIPI_DSI_HOST1)
void MIPI_DSI1_INT_OUT_IRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST1, s_dsiHandle[1]);
}
#endif
